backend/app/controllers/blogs_controller.rb

    def index
        blogs = Blog.all.sort {|a,b| b <=> a}
---
SELECT "blogs".* FROM "blogs"

    def create
        newBlog = Blog.create(title: params[:title], content: params[:content], image: params[:image], post_date: DateTime.now)
---
INSERT INTO "blogs" ("content", "title", "image", "post_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def search
        blogs = Blog.where(category: params[:search])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."category" = ?  [["category", "Misc"]]

    def latest_blog
        lastBlog = Blog.last
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT ?  [["LIMIT", 1]]