backend/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
       projs = Project.all

SELECT "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def latest_project
        lastProj = Project.last