backend/app/controllers/sessions_controller.rb

    def create
        user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "VeryHarryWilz"], ["LIMIT", 1]]

    def destroy
        user = User.find_by(username: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "VeryHarryWilz"], ["LIMIT", 1]]