backend/app/controllers/users_controller.rb

    def create
        user = User.create(username: params[:username], password: params[:password], email: params[:email])
---
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "sgsdgf"], ["password_digest", "[FILTERED]"], ["email", "gfdsgsdfhs"], ["created_at", "2023-03-03 17:55:11.004951"], ["updated_at", "2023-03-03 17:55:11.004951"]]

    def show
        user = User.find_by(username: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "VeryHarryWilz"], ["LIMIT", 1]]